cases/VolumeAreaVerification/VolumeAreaVerification1/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-0.53 -0.7575 -0.7575)
	(5.53 -0.7575 -0.7575)
	(5.53 0.7575 -0.7575)
	(-0.53 0.7575 -0.7575)
	(-0.53 -0.7575 0.7575)
	(5.53 -0.7575 0.7575)
	(5.53 0.7575 0.7575)
	(-0.53 0.7575 0.7575)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (60 15 15) simpleGrading (1.0 1.0 1.0)
);
edges	();
boundary	(
	inlet
	{
		type	patch;
		faces	(
			(0 4 7 3)
		);
	}
	outlet
	{
		type	patch;
		faces	(
			(2 6 5 1)
		);
	}
	boundaries
	{
		type	patch;
		faces	(
			(1 5 4 0)
			(3 7 6 2)
			(0 3 2 1)
			(4 5 6 7)
		);
	}
);
