cases/VolumeAreaVerification/VolumeAreaVerification1/system/fvSolution
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSolution;
}
solvers
{
	p
	{
		solver	GAMG;
		smoother	FDIC; //GaussSeidel;
		relTol	0.01;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	100;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-6;
		mergeLevels	1;
	}
	U
	{
		solver	PBiCGStab;
		relTol	0.1;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
}
SIMPLE
{
	consistent	true;
	nNonOrthogonalCorrectors	1;
	residualControl
	{
		p	1.0E-4;
		U	1.0E-4;
	}
	pRefCell	0;
	pRefValue	0.0;
}
relaxationFactors
{
	p	0.75;
	U	0.75;
}
