cases/VolumeAreaVerification/VolumeAreaVerification1/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;


//use either hierarchial or simple over here

// note that product of the elements should equal numberOfSubdomains



//method          scotch;
method          hierarchical;
//method          simple;
//method          metis;
//method          manual;
// method          multiLevel;
// method          structured;  // does 2D decomposition of structured mesh

multiLevelCoeffs
{
    // Decomposition methods to apply in turn. This is like hierarchical but
    // fully general - every method can be used at every level.

    level0
    {
        numberOfSubdomains  64;
        //method simple;
        //simpleCoeffs
        //{
        //    n           (2 2 1);
        //    delta       0.001;
        //}
        method scotch;
    }
    level1
    {
        numberOfSubdomains  4;
        method scotch;
    }
}

// Desired output

simpleCoeffs
{
    n           (1 2 2);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (1 2 2);
    delta       0.001;
    order       xyz;
}

metisCoeffs
{
    method recursive;
 /*
    processorWeights
    (
        1
        1
        1
        1
    );
  */
}

/*
scotchCoeffs
{
    processorWeights
    (
       1
       1
       1
       1
    );
    writeGraph  true;
    strategy "b";
}
*/
manualCoeffs
{
    dataFile    "manualDecomposition";
}

structuredCoeffs
{
    // Patches to do 2D decomposition on. Structured mesh only; cells have
    // to be in 'columns' on top of patches.
    patches     (movingWall);

    // Method to use on the 2D subset
    method      scotch;
}

distributed     no;
  
roots           ( );

// ************************************************************************* //