cases/VolumeAreaVerification/VolumeAreaVerification1/system/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	fvOptions;
}porosityInzone0
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(2.940198e+00 8.617822e-01 8.617822e-01);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( -1.000000e+00 0.000000e+00 0.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone0;
	}
}
porosityInzone1
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(2.238960e+00 6.562469e-01 6.562469e-01);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( -1.000000e+00 0.000000e+00 -1.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone1;
	}
}
porosityInzone2
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(2.940198e+00 8.617822e-01 8.617822e-01);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( 0.000000e+00 0.000000e+00 -1.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone2;
	}
}
