cases/VolumeAreaVerification/VolumeAreaVerification1/system/surfaceFeatureExtractDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	surfaceFeatureExtractDict;
}
cube.stl
{
	extractionMethod	extractFromSurface;
	includedAngle	120.0;
	geometricTestOnly	false;
}
